app/views/orders/_form.html.erb

  <!-- initialize variables for interface -->
  <% order_user = User.find(@order.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]