app/views/orders/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
      <strong>User:</strong>
      <% user = User.find(@order.user_id) %>