app/views/carts/edit.html.erb

        </tr>
        <% @cart.positions.each do |elem| %>
            <% positions += 1 %>
            <% item = Item.find(elem.item_id).good %>
---
SELECT "positions".* FROM "positions" WHERE "positions"."cart_id" = ?  [["cart_id", 105]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]