app/views/order_mailer/order_formed.html.erb

INSERT INTO "orders" ("appartament", "cart_id", "city", "country", "created_at", "floor", "home", "lane", "personal_payment", "post_code", "region", "shipped", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
<p>Good day <%= @user.name %> </p>
<p> We are happy to notice you that your order (number: <%= @order.id %>, date: <%= @order.created_at %>) has succesfully formed. </p>

SELECT "positions".* FROM "positions" WHERE "positions"."cart_id" = ?  [["cart_id", 115]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
---
  <% positions = 0 %>
  <% @cart.positions.each do |elem| %>
      <% positions += 1 %>
      <% item = Item.find(elem.item_id).good %>