app/controllers/carts_controller.rb

  def remove_position
    # :position_id - passed from carts/edit
    Position.find(params[:position_id].to_i).destroy
---
DELETE FROM "positions" WHERE "positions"."id" = ?  [["id", 103]]
SELECT "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 103]]

  def add_to_cart
    #variables initialisation
    good = Item.where(good_id: params[:item_id].to_i ,good_type: params[:item_type]).first #searching for item
    good_included = false
    position_id = nil

    #searching for before adding
    current_cart.positions.map do |elem|
      if elem.item_id == good.id #if item allready included it remembers it's position id.
        good_included = true
        position_id = elem.id
        break
      end
    end

    #adding for position
    if good_included #if item included -  |1| if not - |2|
      position = Position.find(position_id)
      old_quantity = position.quantity
      position.update_attributes(quantity: old_quantity + params[:quantity].to_i) #|1| - then increment it's quantity
    else
      Position.create(cart_id: current_cart.id ,item_id: good.id, quantity: params[:quantity]) #|2| - create new position
---
SELECT "items".* FROM "items" WHERE "items"."good_id" = 1 AND "items"."good_type" = 'Snowboard' ORDER BY "items"."id" ASC LIMIT 1
SELECT "positions".* FROM "positions" WHERE "positions"."cart_id" = ?  [["cart_id", 106]]
SELECT "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 103]]
UPDATE "positions" SET "quantity" = ?, "updated_at" = ? WHERE "positions"."id" = 103  [["quantity", 3], ["updated_at", Wed, 12 Feb 2014 07:50:03 UTC +00:00]]
INSERT INTO "positions" ("cart_id", "created_at", "item_id", "item_type", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 105], ["created_at", Tue, 11 Feb 2014 13:48:49 UTC +00:00], ["item_id", 1], ["item_type", "Snowboard"], ["quantity", 1], ["updated_at", Tue, 11 Feb 2014 13:48:49 UTC +00:00]]

  def update
    unless params[:position][0].empty? #unless any position included in cart
      params[:position][0].each do |key , value|
        Position.find(key.to_i).update_attributes(quantity: value.to_i) #searching according position and changes it's quantity
---
SELECT "positions".* FROM "positions" WHERE "positions"."id" = ? LIMIT 1  [["id", 105]]
UPDATE "positions" SET "quantity" = ?, "updated_at" = ? WHERE "positions"."id" = 105  [["quantity", 4], ["updated_at", Wed, 12 Feb 2014 09:00:31 UTC +00:00]]

    def set_cart
      @cart = Cart.find(params[:id]) #initializing for cart
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "108"]]