app/controllers/item_controller.rb

  def create
    @categories = Category.all
    @item = smart_new_params
    respond_to do |format|
      if @item.save
---
SELECT "categories".* FROM "categories"
INSERT INTO "items" ("category_id", "created_at", "good_id", "good_type", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category_id", 1], ["created_at", Sat, 15 Feb 2014 15:42:27 UTC +00:00], ["good_id", 8], ["good_type", "Snowboard"], ["updated_at", Sat, 15 Feb 2014 15:42:27 UTC +00:00]]

    def set_item
      #basicly for acces we use reference table - Item. those include references to any good in store
      @item = Item.find(params[:id])
      @categories = Category.all
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "categories".* FROM "categories"