app/controllers/item_controller.rb

SELECT "items".* FROM "items"
---
  def index
    #nothing special
    @items = Item.all