app/controllers/orders_controller.rb

  def new
    order_cart = Cart.find(params[:cart_id].to_i)
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 110]]

  def create
    @order = Order.new(order_params, done: false)
    respond_to do |format|
      if @order.save
        format.html do
          cart = current_cart
          cart.update_attributes(checkouted: true, order_id: @order.id) #refreshing the cart
          current_cart = Cart.create(user_id:current_user.id )
---
INSERT INTO "orders" ("appartament", "cart_id", "city", "country", "created_at", "floor", "home", "lane", "personal_payment", "post_code", "region", "shipped", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", Fri, 14 Feb 2014 10:57:04 UTC +00:00], ["updated_at", Fri, 14 Feb 2014 10:57:04 UTC +00:00], ["user_id", 1]]