app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = 'struan' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'struan.dirk.29@gmail.com' LIMIT 1
---
  def create
    #initializing variables
    search_argument = params[:session][:email]
    user = nil

    #checkcing email or not
    if search_argument.scan(User::EmailRegex)[0] == nil
      user = User.find_by_login(search_argument)
    else
      user = User.find_by_email(search_argument)