app/controllers/user_controller.rb

INSERT INTO "users" ("created_at", "email", "login", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new( user_params )
    if @user.save

UPDATE "users" SET "name" = ?, "login" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["name", "New_user1"], ["login", "New_user1"], ["password_digest", "$2a$10$xuuKEWDIlq00/dJrOL.2b.xCmRcAeDKQxdYjtHwPJGDM8.wZR1jiO"], ["updated_at", Tue, 18 Feb 2014 10:02:11 UTC +00:00]]
---
  def update
    if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = 2
---
  def destroy
    @user.delete

SELECT "users".* FROM "users" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    params[:page] ||= 1
    @users = User.paginate(page: params[:page])